Repository: ftree/ImageProtection
Catalog: src/modules/ImageProtection/locale/*/LC_MESSAGES/module_imageprotection.po
Languages: de

source: Sorry! No authorization to access this module.
de: Sorry! Du hast keine Berechtigungen für das Modul.

source: Done! Module configuration updated.
de: Fertig. Modul Einstellungen gespeichert.

source: Provides API Functions for Image protection
de: Bietet Funktionen um Bilderklau zu erschweren

source: Settings
de: Einstellungen

source: Cache Settings
de: Cache Einstellungen

source: Test
de: Testen

source: Error creating System Hook!
de: Fehler beim Erzeugen des System Hooks!

source: Error creating Module Hook!
de: Fehler beim Erzeugen des Modul Hooks!

source: Error deleting System Hook!
de: Fehler beim Löschen des System Hooks!

source: Error deleting Modul Hook!
de: Fehler beim Löschen des Modul Hooks!

source: Common Settings
de: Allgemeine Einstellungen

source: Max. image width
de: Max. Bild Breite

source: The images will be resized to this width
de: Die Bilder werden auf diese max. Breite beschränkt

source: Max. image height
de: Max. Bild Höhe

source: The images will be resized to this height
de: Die Bilder werden auf diese max. Höhe beschränkt

source: Max. thumbnail width
de: Max. Thumbnail Breite

source: Thumbnails will be resized to this width
de: Die Thumbnails werden auf diese Breite verkleinert

source: Max. thumbnail height
de: Max. Thumbnail Höhe

source: Thumbnails will be resized to this height
de: Die Thumbnails werden auf diese Höhe verkleinert

source: Function to create the Name of the Files
de: Funktion zur Namesvergabe

source: Function
de: Funktion

source: Here you can define a Function witch creates the Names of the files.
de: Hier kann man eine Funktion angeben, die für die Namensgebung der Files zuständig ist.

source: Path settings
de: Pfad Einstellungen

source: Path to the original images
de: Pfad für die Original Bilder

source: Directory exists and has write privilegies!
de: Verzeichnis existiert und hat Schreibzugriff!

source: Directory does not exist or has no write privilegies!
de: Verzeichnis existiert nicht oder hat keinen Schreibzugriff!

source: Here the images are stores, the User uploads. <br/>This should be outside the Document Root.
de: Hier werden die Original Bilder (die der User rauf läd) gepseichert. Dies sollte außerhalb des Document Root liegen.

source: Path to the thumbnail images
de: Pfad für die Thumbnail Bilder

source: Here the thumbnails are stores.
de: Hier werden die Thumbnail Bilder (verkleinerte Original Bilder) gepseichert.

source: Path to the watermark images
de: Pfad für die Watermark Bilder

source: Here the Original watermark Images are stored.<br/>This should be outside the Document Root.
de: Hier werden die Original Wasserzeichen gespeichert.<br/>Sollte außerhalb des Docuemnt Root liegen.

source: Path for div. caches
de: Pfad für div. Caches

source: This is the root for caching.<br/>This should be outside the Document Root.
de: Das ist das Root Verzeichnis für den Bilder Cache.<br/>Sollte auch außerhalb des Document Root liegen. Aus performance Gründen kann es auch unter dem Document Root liegen.

source: Path for resized watermarks
de: Pfad für die verkleinerten Wasserzeichen

source: Here the resized watermarks are stored
de: Hier werden die verkleinerten Wasserzeichen gespeichert.

source: Path for resized Images with watermark
de: Pfad für die verkleinerten Bilder inkl. Wasserzeichen

source: Here the resized images with the resized watermark are stored
de: Hier werden die verkleinerten Bilder mit Wasserezichen gespeichert.

source: Path for images with userspez. watermark
de: Pfad für die Bilder inkl. Userspez. Wasserzeichen

source: Here the images with the userspez. watermark are stored.
de: Hier werden die verkleinerten Bilder mit Userspez. Wasserezichen gespeichert.

source: Path for cropped images
de: Pfad für die zerschnittenen Bilder

source: Here the croped images are stored.
de: Hier werden die zerschnittenen Bilder gespeichert.

source: Path for Temp Images
de: Pfad für temporäre Files

source: This Path is used, if the other directories are under the Documtn Root.<br>This path must be over the Document Root.
de: Diese Pfad wird genutzt falls die anderen Cache Vezeichnisse außerhald des Document Root liegen.

source: Image watermark settings
de: Bild Wasserzeichen Einstellungen

source: Settings to put the watermark on an image
de: Div. Einstellungen um ein Bild mit einem Wasserezichen zu versehen

source: Enabled
de: Aktiviert

source: Enable or disable image watermarking
de: Wasserzeichen Ein oder Aus schalten

source: Position of the watermark
de: Position des Wasserezichens

source: Opacity of the watermark
de: Transparenz des Wasserezichens

source: in percent (100=full Transparence, 0=no Transparence)
de: in Prozent (100=volle Transparenz, 0=keine Transparenz)

source: Watermark Image
de: Wasserzeichen Bild

source: This image will be used for watermarking.<br/>The images will be loaded from the 'Path to the Watermark Images' directory.
de: Dieses Bild wird als Wasserezichen verwendet.<br/>Die Bilder die hier zur Auswahl stehen, werden aus dem "Pfad für die Watermark Bilder" Verzeichnis geladen.

source: Text Watermark Settings
de: Text Wasserzeichen Einstellungen

source: Settings to put a user spezific watermark on the image.
de: Div. Einstellungen um ein Bild mit Userspez. Inhalt als Wasserezichen zu versehen

source: Enable or disable Text watermarking.
de: Sollen Userinformation auf das Bild gedruckt werden?

source: Her you can use a fixed text or a variable from the User modul or from the MyProfil Modul.<br/><strong>User Variables:</strong> %s <br/><strong>MyProfile Varibales:</strong> %s
de: Hier kann ein Fixed Text steht oder Variablen aus dem Userprofil oder aus dem MyProfil Modul.<br/><strong>Uservariablen:</strong> %s<br/><strong>MyProfile Varibalen:</strong> %s

source: Fontsize
de: Schriftgröße

source: Size of the text
de: Schriftgröße des Textes

source: Position of the text
de: Position des Textes

source: Textcolor
de: Textfarbe

source: Color of the text as Hex Code
de: Farbe des Tetes als Hex Code

source: Font
de: Schriftart

source: The fonts will be loaded from the phpThumb Settings<BR/>If this is empty the Setting (TTF Directory) in the Thumbnail Modul is wrong.
de: Die Schriftarten Auswahl wird aus den phpThumb Einstellungen gelesen.<BR/>Sollte hier keine Schriftarten angezeigt werden sind vermutlich die Einstellungen (TTF Directory) im Thumbnail Modul falsch.

source: Opacity of the Text
de: Transparenz des Textes

source: Margin aound the Text
de: Abstand um den Text

source: Margin in pixel
de: Abstand in Pixel

source: Angel of the Text
de: Winkel des Text

source: The text will be rotated with this angel.<BR/>0-360 or 'auto' für automatic. Here the text will be aligned on the diagonale of the image. The best way is to use it with 'Position of the text'=*
de: Winkel in Grad um den der Text gedreht wird.<BR/>0-360 Oder 'auto' für automatische Ermitlung. Hier wird der Text an der Diagonale des Bildes ausgerichtet. Am besten in Verbundung mit 'Alignment'=*

source: Crop Settings
de: Zerschneide Einstellungen

source: Here you can define how the image is cropped.
de: Hier könen div. Einstellungen gemacht werden, wie das Bild zerschnitten werden soll.

source: Enable or disable cropping
de: Sollen die Bilder zerschnitten werden

source: Rows
de: Zeilen

source: Count of rows the image will be cropped.
de: Anzahl der Zeilen in die das Bild zerschnitten wird

source: Columns
de: Spalen

source: Count of columns the image will be cropped. At the moment not implemented
de: Anzahl der Splaten. Im Moment noch nicht implementiert

source: Save
de: Speichern

source: Cancel
de: Abbruch

source: If you have done cahnges here, please delete the complete cache.
de: Solltest du hier was verädert haben, löche bitte auch deinen kompletten Cache.

source: Function - Delete cache
de: Funktion - Cache löschen

source: Delete cache
de: Cache löschen

source: with us of the settings
de: in Ahägigkeit der Einstellungen

source: Function - Delete COMPLETE cache
de: Funktion - KOMPLETTEN Cache löschen

source: Delete COMPLETE cache
de: KOMPLETTEN Cache löschen

source: Delete COMPLETE cache
de: KOMPLETTEN Cache löschen

source: without use of the settings
de: ohne Rücksicht auf die Einstellungen

source: Comomn Settings
de: Allgemeine Einstellungen

source: Should the generated images be caches.<br/> This increases the Perofmance because the images need not be regenrated all the time.
de: Sollen die generierten Bilder zwischen gespeichert werden.<br/> Dies erhöht die Performance da die Bilder nicht ständig erneut generiert werden müssen.

source: Age of resized watermarks
de: Alter für die verkleinerten Wasserzeichen

source: Age after that the image are deleted out of the cache <br/>0 for no delete
de: Alter der Bilder in Tagen, nachdem sie aus dem Cache gelöscht werden. <br/>0 für kein löschen

source: Files (%s) in cache
de: Files (%s) im Cache

source: Files (%s) deleted
de: Files (%s) gelöscht

source: Age of resized images with watermark
de: Alter für die verkleinerten Bilder inkl. Wasserzeichen

source: Age of images with userspez. watermark
de: Alter für die Bilder inkl. userspez. Wasserzeichen

source: Age of cropped images
de: Alter für die zerschnittenen Bilder

source: Age of temp. images
de: Alter für temporäre Files

source: Select an image to test:
de: Wähle ein Bild zum Testen:

source: Show Result
de: Zeige Ergebnis

source: Show Debug Info:
de: Zeige Debug Info:

source: Force Image regeneration:
de: Bilder Neugenerierung erzwingen:

source: Normaly this is disaable in testmode
de: Normalerweise ist dies im Tesmodus deaktiviert

source: Show Image
de: Zeige Bild

source: Insert Image
de: Bild einfügen

source: Description
de: Beschreibung

source: Orientation
de: Ausrichtung

source: not set
de: nicht zugewiesen

source: left
de: links

source: right
de: rechts

source: center
de: zentriert
